import React, { memo, useRef, useEffect } from 'react'
import * as echarts from 'echarts';
import { useDispatch } from 'react-redux'

import { changedetails } from '@/Redux/Actions'//引用redux的方法
import './Less/index.less'
export default memo(function Outback() {
    const Ref = useRef()

    const dispatch = useDispatch()
    useEffect(() => {
        const Mycharts = echarts.init(Ref.current)
        const option = {
            title: {
                text: '2020各地开行列数',
                left: 'center'
            },
            tooltip: {
                trigger: 'item'
            },

            series: [
                {
                    type: 'pie',
                    radius: '50%',
                    data: [
                        {
                            value: 3720,
                            name: '西安',
                            obj: {
                                color: '#546fc6',
                                content: `2020年中欧班列长安号危中寻机、
                                全面发力，全年开行3720列，是上年的1.7倍，
                                创历史新高。运送货物总重达281.1万吨，
                                是上年的1.6倍，其中欧洲方向约占全国市场总量的20%，
                                超过8万吨防疫物资运抵欧洲，为国际防疫合作提供了有力支持。
                                中欧班列长安号再次实现了跨越式增长，质量评价指标位居全国第一。`,
                                data: {
                                    total: [{ value: 3720, name: '西安' }]
                                }
                            }
                        },
                        {
                            value: 9679,
                            name: '新疆',
                            obj: {
                                color: '#91cb74',
                                content: '2020年，中欧班列承接了大量由海运、空运转移的出境货运业务，新疆阿拉山口、霍尔果斯口岸通道作用明显。其中，经阿拉山口站进出境中欧班列达5027列，同比增长41.8%；经霍尔果斯站进出境中欧班列达4652列，同比增长37%，均为历史最高。',
                                data: {
                                    total: [
                                        { value: 9679, name: '新疆' },
                                        {
                                            details: [
                                                { value: 5027, name: '阿拉山口' },
                                                { value: 4652, name: '霍尔果斯' }
                                            ]
                                        }
                                    ]

                                }
                            }
                        },
                        {
                            color: '#fac859',
                            value: 1126,
                            name: '郑州',
                            obj: {
                                color: '#fac859',
                                content: '作为河南“陆上丝绸之路”的重要承载，2020年中欧班列（郑州）开行量和载货量创新高。2020年截止12月31日，班列全年总累计开行1126班，累计货值42.77亿美元，累计货重71.49万吨。',
                                data: {
                                    total: [
                                        { value: 1126, name: '郑州' },
                                    ]

                                }
                            }
                        },
                        {
                            color: '#f1675d',
                            value: 1399,
                            name: '浙江',
                            obj: {
                                color: '#e36a71',
                                content: '2020年浙江中欧班列共开行1399列，共发运115534标箱，同比增长129.6%。其中，义乌中欧班列共开行974列，共发运80392标箱，同比增长90.2%；金华中欧班列共开行425列，共发运35142标箱，同比增长313%。',
                                data: {
                                    total: [
                                        { value: 1399, name: '浙江' },
                                        {
                                            details: [
                                                { value: 974, name: '义乌中欧' },
                                                { value: 425, name: '金华中欧' }
                                            ]
                                        }
                                    ]

                                }
                            }
                        },
                        {
                            value: 528,
                            name: '长沙',
                            obj: {
                                color: '#74bfdf',
                                content: '2020年中欧班列(长沙)开行量创新高，全年共开行528列，同比增长28.47%;货值206128.98万美元，同比增长98.58%，超额完成全年目标任务。',
                                data: {
                                    total: [
                                        { value: 528, name: '长沙' },

                                    ]

                                }
                            }
                        },
                        {
                            value: 215,
                            name: '武汉',
                            obj: {
                                color: '#3ea071',
                                content: '2020年中欧班列（武汉）已累计发运215列，其中去程101列10008TEU，运输货物主要有机械产品、电子产品、汽车整车及零配件、防疫物资，先后向德国、塞尔维亚、波兰等国运送口罩、防护服、呼吸机等防疫物资770TEU、5660吨。回程114列10184TEU，首次实现全年回程班列100%重箱。回程货源主要有木材、机电产品、汽车零部件、化工品、乳制品等。',
                                data: {
                                    total: [
                                        { value: 215, name: '武汉' },
                                        {
                                            details: [
                                                { value: 101, name: '去程' },
                                                { value: 114, name: '回程' }
                                            ]
                                        }
                                    ]

                                }
                            }
                        },
                        {
                            value: 218,
                            name: '黑龙江',
                            obj: {
                                color: '#f98262',
                                content: '黑龙江绥芬河站是我国重要的对俄铁路口岸，也是中欧班列重要的进出境口岸之一。2020年，经该口岸出入境的中欧班列达218列。',
                                data: {
                                    total: [
                                        { value: 218, name: '黑龙江' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 238,
                            name: '江西',
                            obj: {
                                color: '#9f60b1',
                                content: '2020年，赣州国际陆港克服疫情影响，全年开行中欧(亚)班列238列，铁海联运“三同”班列1553列，港口吞吐量(铁路口岸标箱)达18.6万标箱。',
                                data: {
                                    total: [
                                        { value: 238, name: '江西' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 273,
                            name: '厦门',
                            obj: {
                                color: '#e37ace',
                                content: '2020年共监管中欧班列273列，货物24112标箱、14.24万吨，货值62.2亿元(人民币，下同)，同比分别增长17%、36%、59%、40%，均创历年新高。',
                                data: {
                                    total: [
                                        { value: 237, name: '厦门' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 376,
                            name: '沈阳',
                            obj: {
                                color: '#4d6dc4',
                                content: '中欧班列共计开行376列，同比上涨79.05%;累计发运30966TEU(TEU即国际标准箱单位)，同比上涨64.50%;累计承运货值16.41亿美金，同比上涨85.21%。东北地区，包括沈阳、大连、长春、哈尔滨、通辽在内的市场占有率达到63.96%，同比上涨12%;年开行总量位列全国第九名，取得了跨越式的发展。',
                                data: {
                                    total: [
                                        { value: 376, name: '沈阳' },

                                    ]

                                }
                            }
                        },
                        {
                            value: 2600,
                            name: '重庆',
                            obj: {
                                color: '#91cb74',
                                content: '2020年中欧班列（渝新欧）共开行2603班，同比增长72%，运输货值超900亿元，同比增长65%。开行10年以来，中欧班列（渝新欧）累计开行中欧班列超7000列，累计开行数量、发运货值居全国首位。',
                                data: {
                                    total: [
                                        { value: 2600, name: '重庆' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 5000,
                            name: '成渝号',
                            obj: {
                                color: '#fac859',
                                content: '2020年，成渝两地中欧班列开行数量近5000列，历年累计开行量达14000列，占中国中欧班列开行总量40%以上。2021年首列中欧班列(成渝)号发车，是中国国家铁路集团有限公司首次批准成渝两地统一品牌。',
                                data: {
                                    total: [
                                        { value: 5000, name: '成渝号' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 1500,
                            name: '山东',
                            obj: {
                                color: '#ee6668',
                                content: '在国际航班受疫情影响锐减，海运航线停班停航的情况下，“齐鲁号”欧亚班列充分发挥陆路重要通道作用，推出齐鲁号“日韩陆海快线”“鲁欧快线”“上合快线”等服务产品，为满足外贸企业出口开行定制化专列。新增“济西-满洲里（境）”“济西-二连浩特（境）”图定线路，城市间线路增加至40条，可以直达“一带一路”沿线17个国家45个城市，2020年累计开行1506列，同比增长43%。',
                                data: {
                                    total: [
                                        { value: 1500, name: '山东' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 361,
                            name: '苏州',
                            obj: {
                                color: '#ee6668',
                                content: '2020年1-12月苏州中欧班列累计开行进出口班列361列、搭载40呎集装箱14860个、货重23.01万吨、货值13.53亿美元。同比班列数上涨34.2%，箱数增长25.2%，货重增长43.1%，货值增长8.24%。其中：出口班列293列，发运40呎集装箱12054箱，货值12.47亿美元，货重16.77万吨；进口班列68列，发运40呎集装箱2806箱，货值1.06亿美元，货重6.24万吨。',
                                data: {
                                    total: [
                                        { value: 361, name: '苏州' },
                                        {
                                            details: [
                                                { value: 293, name: '出口班列' },
                                                { value: 68, name: '进口班列' }
                                            ]
                                        }
                                    ]

                                }
                            }
                        },
                        {
                            value: 568,
                            name: '合肥',
                            obj: {
                                color: '#a0dfc4',
                                content: '合肥海关细化出台16项措施，拓宽中欧班列贸易形式，开启“中欧班列+跨境电商”“中欧班列+保税入仓”等新通道，推动外贸新业态“提质扩容”。2020年合肥中欧班列成功开行568列，发运4.6万标箱，同比增长35.2%，35.2%。',
                                data: {
                                    total: [
                                        { value: 568, name: '合肥' },
                                    ]

                                }
                            }

                        },
                        {
                            value: 206,
                            name: '山西',
                            obj: {
                                color: '#df9a71',
                                content: '2020年晋欧班列开行206列，货运量17.69万吨，货值31.91亿元。累计开行中欧中亚班列373列，货运量35.85万吨，货值53.85亿元。',
                                data: {
                                    total: [
                                        { value: 206, name: '山西' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 262,
                            name: '广东',
                            obj: {
                                color: '#c5abce',
                                content: '2020年，粤港澳大湾区中欧班列持续高位运行，开行数量不断增加。全年，大湾区共开行中欧班列262列，与去年基本持平。进入2020年第四季度以来，广州大朗、东莞石龙每周至少开行3列，深圳平湖南每周2列常态化开行。穗莞深三地第四季度中欧班列开行数量环比增长76%。',
                                data: {
                                    total: [
                                        { value: 262, name: '广东' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 304,
                            name: '徐州',
                            obj: {
                                color: '#dd90ba',
                                content: '徐州中欧班列2020年开行数量304列，徐州中欧班列已跻身全国中欧班列开行城市的前列。目前，徐州形成了至二连浩特、满洲里、霍尔果斯、阿拉山口“四线同行”的班列通道，特别是“徐工专列”和木材进口班列，有力推动了徐州的产业国际化。',
                                data: {
                                    total: [
                                        { value: 304, name: '徐州' },
                                    ]

                                }
                            }
                        },
                        {
                            value: 526,
                            name: '连云港',
                            obj: {
                                color: '#6e7cad',
                                content: '1至11月份连云港中欧班列累计完成43114标箱、526列，同比增长22.9%。',
                                data: {
                                    total: [
                                        { value: 526, name: '连云港' },
                                    ]

                                }
                            }

                        },
                        {
                            value: 105,
                            name: '石家庄',
                            obj: {
                                color: '#90ce78',
                                content: '2020年，石家庄中欧班列创年开行数量新高，全年进出境班列105列，其中出境100列、入境5列，较上年全年开行总量增长14倍。进入2020年8月以后，中欧班列发运频率从每周1列逐步提升到每周3至4列。',
                                data: {
                                    total: [
                                        { value: 105, name: '石家庄' },
                                        {
                                            details: [
                                                { value: 100, name: '出口班列' },
                                                { value: 5, name: '进口班列' }
                                            ]
                                        }
                                    ]

                                }
                            }
                        },
                        {
                            value: 126,
                            name: '内蒙古乌兰察布',
                            obj: {
                                color: '#fde8a5',
                                content: '乌兰察布七苏木中欧班列共计开行班列126列，主要发往俄罗斯与白俄罗斯，货源结构以木材、乳清粉、油葵子等品类为主，发运数量同比增长12.2%,占自治区38.34%，货值2.25亿美元，货重7.63万吨。其中，乌兰察布本地货源共计849箱，同比增长157.3%。',
                                data: {
                                    total: [
                                        { value: 126, name: '内蒙古乌兰察布' },
                                        {
                                            details: [
                                                { value: 100, name: '出口班列' },
                                                { value: 5, name: '进口班列' }
                                            ]
                                        }
                                    ]

                                }
                            }
                        },

                    ],
                    emphasis: {
                        itemStyle: {
                            shadowBlur: 10,
                            shadowOffsetX: 0,
                            shadowColor: 'rgba(0, 0, 0, 0.5)'
                        }
                    }
                }
            ]
        };
        Mycharts.setOption(option)
        Mycharts.on('click', p => {
            dispatch(changedetails(p.data))
        })
    }, [dispatch])

    return (
        <div className='outback' ref={Ref}>

        </div>
    )
})
